app/Models/ModelRumah.php

SELECT *
FROM `tbl_rumah`
LEFT JOIN `tbl_keterangan` ON `tbl_keterangan`.`id_keterangan` = `tbl_rumah`.`id_keterangan`
---
    public function AllData()
    {
        return $this->db->table('tbl_rumah')
        ->join('tbl_keterangan', 'tbl_keterangan.id_keterangan = tbl_rumah.id_keterangan', 'left')
            ->get()->getResultArray();