app/Models/ModelKeterangan.php

SELECT *
FROM `tbl_keterangan`
---
    public function AllData()
    {
        return $this->db->table('tbl_keterangan')
            ->get()->getResultArray();